# P30 Map & Apply

In [1]:
import pandas as pd

In [2]:
train=pd.read_csv(r"C:\Users\liudonghang\Documents\Python Scripts\Data analysis with pandas\pandas-videos-master\data\titanic_train.csv")
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
train['Sex_male']=train.Sex.map({'male':1, 'female':0})
train.loc[:4, ['Sex', 'Sex_male']]

      Sex  Sex_male
0    male         1
1  female         0
2  female         0
3  female         0
4    male         1

In [4]:
train.Sex_male.map(lambda x:x+100).head()

0    101
1    100
2    100
3    100
4    101
Name: Sex_male, dtype: int64

## Series的apply是对每个单元格,DataFrame是对每一坐标轴

In [5]:
train['len_of_name']=train.Name.apply(len)
train.loc[:4, ['Name', 'len_of_name']]

                                                Name  len_of_name
0                            Braund, Mr. Owen Harris           23
1  Cumings, Mrs. John Bradley (Florence Briggs Th...           51
2                             Heikkinen, Miss. Laina           22
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)           44
4                           Allen, Mr. William Henry           24

In [6]:
import numpy as np
train['fare_ceil']=train.Fare.apply(np.ceil)
train.loc[:4, ['Fare', 'fare_ceil']]

      Fare  fare_ceil
0   7.2500        8.0
1  71.2833       72.0
2   7.9250        8.0
3  53.1000       54.0
4   8.0500        9.0

In [7]:
train.Name.str.split(pat=',').head()

0                           [Braund,  Mr. Owen Harris]
1    [Cumings,  Mrs. John Bradley (Florence Briggs ...
2                            [Heikkinen,  Miss. Laina]
3      [Futrelle,  Mrs. Jacques Heath (Lily May Peel)]
4                          [Allen,  Mr. William Henry]
Name: Name, dtype: object

In [8]:
train.Name.str.split(pat=',').apply(lambda x: x[0]).head()

0       Braund
1      Cumings
2    Heikkinen
3     Futrelle
4        Allen
Name: Name, dtype: object

In [9]:
def get_elements(list, position):
    return list[position]
train.Name.str.split(',').apply(get_elements, position=0).head()

0       Braund
1      Cumings
2    Heikkinen
3     Futrelle
4        Allen
Name: Name, dtype: object

In [10]:
train.Name.str.split(',', expand=True).head()

           0                                            1
0     Braund                              Mr. Owen Harris
1    Cumings   Mrs. John Bradley (Florence Briggs Thayer)
2  Heikkinen                                  Miss. Laina
3   Futrelle           Mrs. Jacques Heath (Lily May Peel)
4      Allen                            Mr. William Henry

In [11]:
drinks=pd.read_csv(r"C:\Users\liudonghang\Documents\Python Scripts\Data analysis with pandas\pandas-videos-master\data\drinks.csv")
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [12]:
drinks.max()

country                              Zimbabwe
beer_servings                             376
spirit_servings                           438
wine_servings                             370
total_litres_of_pure_alcohol             14.4
continent                       South America
dtype: object

In [13]:
drinks.apply(max, axis=0)

country                              Zimbabwe
beer_servings                             376
spirit_servings                           438
wine_servings                             370
total_litres_of_pure_alcohol             14.4
continent                       South America
dtype: object

In [14]:
drinks.apply(np.argmax, axis=0).head(1)

C:\Users\liudonghang\AppData\Local\Continuum\anaconda3\lib\site-packages\numpy\core\fromnumeric.py:56: FutureWarning:
The current behaviour of 'Series.argmax' is deprecated, use 'idxmax'
instead.
The behavior of 'argmax' will be corrected to return the positional
maximum in the future. For now, use 'series.values.argmax' or
'np.argmax(np.array(values))' to get the position of the maximum
row.
  return getattr(obj, method)(*args, **kwds)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,192,117,68,61,15,6

In [15]:
drinks.values.argmax(axis=0)

array([192, 117,  68,  61,  15,   6], dtype=int64)

In [16]:
drinks.iloc[:, 1:5].applymap(lambda x: x+1).head()

   beer_servings  spirit_servings  wine_servings  total_litres_of_pure_alcohol
0              1                1              1                           1.0
1             90              133             55                           5.9
2             26                1             15                           1.7
3            246              139            313                          13.4
4            218               58             46                           6.9

In [17]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [18]:
drinks.iloc[:, 1:5].applymap(float).head()

   beer_servings  spirit_servings  wine_servings  total_litres_of_pure_alcohol
0            0.0              0.0            0.0                           0.0
1           89.0            132.0           54.0                           4.9
2           25.0              0.0           14.0                           0.7
3          245.0            138.0          312.0                          12.4
4          217.0             57.0           45.0                           5.9

In [40]:
drinks['x']=drinks.wine_servings*1000
drinks.x.map(lambda x: '{:,}'.format(x)).head()

0          0
1     54,000
2     14,000
3    312,000
4     45,000
Name: x, dtype: object